---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRunEndWithRiser
source: html/73d73f0b-de18-e558-96a6-b69eec98a2e7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRunEndWithRiser Property

"End with Riser": End with Riser

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRunEndWithRiser { get; }
```